// #1 Подсчет очков

// Представьте, что вы играете в какую-нибудь игру со своими друзьями и вам нужно вести счет. Создайте для этого объект и назовите его scores. Пусть ключами будут имена ваших друзей, а значениями — набранные ими очки (0 или больше). Счет игроков надо будет увеличивать по мере того, как они зарабатывают новые очки. Как вы будете менять счет игрока, хранящийся в объекте scores?

let scores = {};

scores["Тата"] = 7;
scores["Эдди"] = 9;
scores["Алена"] = 4;
scores["Маша"] = 4;
scores["Полина"] = 8;
scores["Сусанна"] = 3;
scores["Катя"] = 7;

console.log(scores);

scores["Тата"] += 2;

console.log(scores["Тата"]);